{
  "url": "https://api.github.com/repos/status-im/status-desktop/issues/10911",
  "repository_url": "https://api.github.com/repos/status-im/status-desktop",
  "labels_url": "https://api.github.com/repos/status-im/status-desktop/issues/10911/labels{/name}",
  "comments_url": "https://api.github.com/repos/status-im/status-desktop/issues/10911/comments",
  "events_url": "https://api.github.com/repos/status-im/status-desktop/issues/10911/events",
  "html_url": "https://github.com/status-im/status-desktop/issues/10911",
  "id": 1738696312,
  "node_id": "I_kwDOD5KrTM5nomZ4",
  "number": 10911,
  "title": "Make it possible to load a specific page of messages in the context of navigating to a message",
  "user": {
    "login": "jrainville",
    "id": 11926403,
    "node_id": "MDQ6VXNlcjExOTI2NDAz",
    "avatar_url": "https://avatars.githubusercontent.com/u/11926403?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/jrainville",
    "html_url": "https://github.com/jrainville",
    "followers_url": "https://api.github.com/users/jrainville/followers",
    "following_url": "https://api.github.com/users/jrainville/following{/other_user}",
    "gists_url": "https://api.github.com/users/jrainville/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/jrainville/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/jrainville/subscriptions",
    "organizations_url": "https://api.github.com/users/jrainville/orgs",
    "repos_url": "https://api.github.com/users/jrainville/repos",
    "events_url": "https://api.github.com/users/jrainville/events{/privacy}",
    "received_events_url": "https://api.github.com/users/jrainville/received_events",
    "type": "User",
    "site_admin": false
  },
  "labels": [
    {
      "id": 3047427135,
      "node_id": "MDU6TGFiZWwzMDQ3NDI3MTM1",
      "url": "https://api.github.com/repos/status-im/status-desktop/labels/feature",
      "name": "feature",
      "color": "0E8A16",
      "default": false,
      "description": ""
    },
    {
      "id": 4548141040,
      "node_id": "LA_kwDOD5KrTM8AAAABDxcf8A",
      "url": "https://api.github.com/repos/status-im/status-desktop/labels/messenger-team",
      "name": "messenger-team",
      "color": "232858",
      "default": false,
      "description": ""
    }
  ],
  "state": "open",
  "locked": false,
  "assignee": null,
  "assignees": [

  ],
  "milestone": {
    "url": "https://api.github.com/repos/status-im/status-desktop/milestones/65",
    "html_url": "https://github.com/status-im/status-desktop/milestone/65",
    "labels_url": "https://api.github.com/repos/status-im/status-desktop/milestones/65/labels",
    "id": 9039509,
    "node_id": "MI_kwDOD5KrTM4Aie6V",
    "number": 65,
    "title": "0.15",
    "description": "**1. Finish anything that wasn't completed in the previous 0.14 cycle**\r\n\r\n- And fix bugs as usual. We need to keep tech. debt at a roughly fixed level as we grow out functionality, can't let it accumulate! ;-)\r\n\r\n**2. Tokenisation of community ownership**\r\n\r\n- Work needed already evaluated in spike.  Community and 'Channel in a Community' URLs don't need to be signed if this will present problems. Patryk to work on this as a continuation of the spike already done.\r\n- See priority 4 below, as this also has some implications for the tokenisation of community work.\r\n\r\n**3. Profile showcase backend**\r\n- The long-delayed profile showcase backend!  We have the UI on the desktop ready to go for this feature, and Mobile is going to need the backend for this feature as well, so let's try to get it done in 0.14 [#11081](https://github.com/status-im/status-desktop/issues/11081)\r\n\r\n**4. Community tokens visible in wallet when received by user who is not a member of that community**\r\n- Solution obvs. needs to be fully decenteralised and permissionless\r\n- Perhaps whenever a community token is A) sent from a Status Wallet to another user or B) airdropped by a community or C) retailed by a community, a M2M (invisible to the user) Waku message should be sent to the recipient's *ethereum address*?\r\n- This message could either: A) contain the metadata for the token B) tell the user that they have received token, and to check the metadata in either another Waku channel where Control Nodes periodically post Metadata OR check the metadata embedded in the token contract (embedding metadata in the token contract might be a better idea?).  \r\n- The token metadata stored in the token contract is signed by the Community's private key to ensure authenticity.  When the community's private key changes due to ownership of a community being transferred or due to the control node being moved, a transaction must be made to update this metadata so it is signed by the community's new private key.\r\n- See here for how a Waku message can be sent to and Ethereum address https://rfc.vac.dev/spec/20/\r\n\r\n**5. Complete initial airdrop functionality**\r\n- Airdrop history screens\r\n- Ability to airdrop based on in-Community activity (No. of msg, No. msg in time range, joining a community, length of community membership)  Ability to combine multiple attributes into an airdrop\r\n- Ability to token gate airdrops\r\n- Live airdrop gas estimation when setting up airdrop\r\n\r\n**6. Token import functionality**\r\n- Ability for a community Owner to import ERC-20 and NFT tokens, to later be airdropped or retailed\r\n\r\n**7. Admin functionality enhancements**\r\n- Ability to mark a token gated channel as 'hidden', only visible to community members with the requisite tokens\r\n- optional service to once a month auto-kick all members who haven't been online for between 30 and 60 days (e.g. auto-kick members whose profile information like Name, Avatar, etc... can no longer be fetched)\r\n\r\n**8. QR scanner**\r\n- Needed for private key transfer\r\n- Ethereum key QRs (send modal triggered)\r\n- User Share URL in a QR (opens user profile dialogue) \r\n- Community and Channel inside Community URL in QRs (takes user to Community or Channel in Community)\r\n\r\n**9. Chat functionality enhancements**\r\n- Introduce @channel as a new type of global @ mention.  This @ mention only @ mention's everyone who has posted a message in a channel in the last 30 days \r\n- Introduce the ability to search the users in the right side members/users bar.  At the same time, make any adaptations needed so that the right side members/users bar can scale to 10,000 users.\r\n\r\n\r\n**--- Wallet Team ---**\r\n\r\n1. Sending Community created tokens to Status users who are not members of that community\r\n- See priority 4) in the messaging priorities list above.\r\n\r\n2. Send NFT functionality\r\n\r\n3. WalletConnect 2.0 support\r\n\r\n4. Total balance graphs for 'All accounts' and each individual account\r\n\r\n5. Advanced transaction signing\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "creator": {
      "login": "iurimatias",
      "id": 176720,
      "node_id": "MDQ6VXNlcjE3NjcyMA==",
      "avatar_url": "https://avatars.githubusercontent.com/u/176720?v=4",
      "gravatar_id": "",
      "url": "https://api.github.com/users/iurimatias",
      "html_url": "https://github.com/iurimatias",
      "followers_url": "https://api.github.com/users/iurimatias/followers",
      "following_url": "https://api.github.com/users/iurimatias/following{/other_user}",
      "gists_url": "https://api.github.com/users/iurimatias/gists{/gist_id}",
      "starred_url": "https://api.github.com/users/iurimatias/starred{/owner}{/repo}",
      "subscriptions_url": "https://api.github.com/users/iurimatias/subscriptions",
      "organizations_url": "https://api.github.com/users/iurimatias/orgs",
      "repos_url": "https://api.github.com/users/iurimatias/repos",
      "events_url": "https://api.github.com/users/iurimatias/events{/privacy}",
      "received_events_url": "https://api.github.com/users/iurimatias/received_events",
      "type": "User",
      "site_admin": false
    },
    "open_issues": 92,
    "closed_issues": 6,
    "state": "open",
    "created_at": "2023-02-13T19:08:52Z",
    "updated_at": "2023-07-17T08:39:26Z",
    "due_on": "2023-09-29T07:00:00Z",
    "closed_at": null
  },
  "comments": 0,
  "created_at": "2023-06-02T19:24:25Z",
  "updated_at": "2023-07-17T13:51:41Z",
  "closed_at": null,
  "author_association": "MEMBER",
  "active_lock_reason": null,
  "body": "### Description\r\n\r\nRight now, when navigating to a message either from search, from a pinned or reply message or later from a link, we get messages from the DB in order from newest to oldest until we reach the right message.\r\n\r\nHowever, this can be pretty slow and also not great for memory, as we have to load a lot of useless messages.\r\n\r\nThe solution would be to instead have a new status-go function that loads a page of messages with the specific message we want in the middle.\r\n\r\nThen we can update the chat view with those messages and we wouldn't have to get all those in between messages.\r\n\r\nThere are a couple of important details however:\r\n- we'd need to show the loading screen when doing that get, since it might take time\r\n- once we show the retrieved messages, we need to highlight the clicked message (might already be the case)\r\n- we need to still support scrolling up to load more old messages, but this is not the same cursor as the one from the \"normal\" chat list, since we are way higher. That means status-go, when returning the page of messages, also needs to tell us what was that cursor\r\n- we would now need a new scroll behavior where scrolling down loads newer messages. This also requires a new cursor\r\n- we need to show the \"go down button\" to go back to recent messages, but without triggering the message load for newer messages from the line above\r\n\r\nI'm not exactly sure what is the best way to achieve the UI part of it. It might require new components that create a gap between the most recent messages (the normal chat list), and the navigated messages, since there would be lots of missing messages between them.\r\n\r\nMaybe that \"gap\" (let's find a new word for that since we already use gap for store node gaps) component would be the one to store which cursor it is using, that was we know which page to load when scrolling.\r\n\r\n### Acceptance Criteria\r\n\r\n- Navigating to a message, whatever the way, goes to it directly without just scrolling up and  up like right now (so it is faster)\r\n- There is a loading screen/state when loading the messages\r\n- The clicked message is highlighted for a short time (the already implemented highlight feature)\r\n- Scrolling up still works and loads older message from that subset of messages, ie if the page of message is from february, then scrolling up gets messages from february, than january, etc\r\n- Scrolling down loads newer messages, again with the same logic as above\r\n- There is a \"go back down\" button. When it is clicked, it should be instant and there should **not** be any message loading. We just go down to the most recent messages that were already loaded\r\n- Clicking again on the same message link/pin, it should be instant since we already loaded the message (it doesn't load again)\r\n\r\n",
  "closed_by": null,
  "reactions": {
    "url": "https://api.github.com/repos/status-im/status-desktop/issues/10911/reactions",
    "total_count": 0,
    "+1": 0,
    "-1": 0,
    "laugh": 0,
    "hooray": 0,
    "confused": 0,
    "heart": 0,
    "rocket": 0,
    "eyes": 0
  },
  "timeline_url": "https://api.github.com/repos/status-im/status-desktop/issues/10911/timeline",
  "performed_via_github_app": null,
  "state_reason": null
}
[

]
